#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Mama', 'Papa', ' I am']
height = [177,189,167]
#my_family_height = [
    # ['имя', рост],
#    [],]
my_family_height = [['Mama',178], ['Papa',167], [' I am',194]]
print(my_family_height[1][1],my_family_height[0][1]+my_family_height[1][1]+my_family_height[2][1])



# список списков приблизителного роста членов вашей семьи


# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
